name: "ensemble"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "INPUT"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]

output [
  {
    name: "boxes"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  },
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  },
  {
    name: "labels"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT"
      }
      output_map {
        key: "OUTPUT_0"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "yolov5n"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocessed_image"
      }
      output_map {
        key: "output0"
        value: "inferenced_image"
      }
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "inferenced_image"
      }
      output_map {
        key: "OUTPUT_0"
        value: "boxes"
      }
      output_map {
        key: "OUTPUT_1"
        value: "scores"
      }
      output_map {
        key: "OUTPUT_2"
        value: "labels"
      }
    }
  ]
}

version_policy: { 
  latest: { num_versions: 1 }
}

response_cache { 
  enable: True 
}