name: "object_detection"
platform: "tensorrt_plan"
max_batch_size : 0

input [
  {
    name: "images"
    data_type: TYPE_FP16
    dims: [ 1, 3, 640, 640 ]
  }
]

output [
  {
    name: "output0"
    data_type: TYPE_FP16
    dims: [ 1, 25200, 6 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

version_policy: { 
  latest: { num_versions: 1 }
}

response_cache { 
  enable: True
}