name: "preprocess"
backend: "python"
max_batch_size: 0

input [
  {
    name: "INPUT_0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]
 
output [
  {
    name: "OUTPUT_0"
    data_type: TYPE_FP16
    dims: [ -1, -1, -1, -1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

version_policy: { 
  latest: { num_versions: 1 }
}

response_cache { 
  enable: True 
}